export const translationMaps = {
    '机动车：状态': {
        'A': '正常',
        'B': '违法未处理',

    },
    '机动车：号牌种类': {
        '01': '大型汽车',
        '02': '小型汽车',
        '03': '使馆汽车',
        '04': '领馆汽车',
        '05': '境外汽车',
        '06': '外籍汽车',
        '07': '普通摩托车',
        '08': '轻便摩托车',
        '09': '使馆摩托车',
        '10': '领馆摩托车',
        '11': '境外摩托车',
        '12': '外籍摩托车',
        '13': '低速车',
        '14': '拖拉机',
        '15': '挂车',
        '16': '教练汽车',
        '17': '教练摩托车',
        '20': '临时入境汽车',
        '21': '临时入境摩托车',
        '22': '临时行驶车',
        '23': '警用汽车',
        '24': '警用摩托',
        '25': '原农机号牌',
        '26': '香港入出境车',
        '27': '澳门入出境车',
        '31': '武警号牌',
        '32': '军队号牌',
        '41': '无号牌',
        '42': '假号牌',
        '43': '挪用号牌',
        '51': '大型新能源汽车',
        '52': '小型新能源汽车',
        '99': '其他号牌'
    },
    '机动车：业务类型': {
        'A': '注册',
        'B': '转让',
        'D': '变更',
        'E': '抵押',
        'F': '停驶',
        'G': '注销',
        'H': '辅助装置/异地变更/异地尾板',
        'I': '转入',
        'J': '校车',
        'K': '补换牌证',
        'L': '登记证书',
        'M': '更正',
        'N': '被盗抢',
        'O': '临牌',
        'P': '检验标志',
        'R': '异地检验标志',
        'S': '锁定解锁',
        'T': '解除海关监管',
        'U': '恢复',
        'V': '变更备案'
    },
    '机动车：业务原因': {
        'A':
        {
            'A': '注册',
            'B': '注册抵押',
            'C': '武警改挂注册',
        },
        'B':
        {
            'A': '辖区内不选号',
            'B': '辖区内选号',
            'C': '转出管辖区',
        },

    },
    '驾驶员：业务类型': {
        'A': '初次申领',
        'B': '增驾申请',

    },
    '驾驶员：业务原因': {
        'A':
        {
            'A': '本地',
            'B': '外地',
            'C': '军警',
        },
        'B':
        {
            'A': '增驾申请',
            'B': '恢复原被注销准驾车型',
            'C': '降级后恢复增驾C6车型',
        },

    }
};

export type TranslationKey = keyof typeof translationMaps; 