export const translationMaps = {
    '机动车：状态': {
        'A': '正常',
        'B': '违法未处理',

    },
    '机动车：号牌种类': {
        '01': '大型汽车',
        '02': '小型汽车',
    },
    '机动车：业务类型': {
        'A': '注册',
        'B': '转让',

    },
    '机动车：业务原因': {
        'A':
        {
            'A': '注册',
            'B': '注册抵押',
            'C': '武警改挂注册',
        },
        'B':
        {
            'A': '辖区内不选号',
            'B': '辖区内选号',
            'C': '转出管辖区',
        },

    },
    '驾驶员：业务类型': {
        'A': '初次申领',
        'B': '增驾申请',

    },
    '驾驶员：业务原因': {
        'A':
        {
            'A': '本地',
            'B': '外地',
            'C': '军警',
        },
        'B':
        {
            'A': '增驾申请',
            'B': '恢复原被注销准驾车型',
            'C': '降级后恢复增驾C6车型',
        },

    }
};

export type TranslationKey = keyof typeof translationMaps; 